# StairsRuntypeStructure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRuntypeStructure Property
ParameterTypeId Class See Also
---
"Structure": Structure
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRuntypeStructure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRuntypeStructure As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRuntypeStructure {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace